
## Plan Result (aat)




<pre><code>Plan: 5 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_api_management_subscription.fee_pay_team_payment_subscription
  * azurerm_api_management_subscription.liberata_supplier_subscription
  * azurerm_key_vault_secret.fee_pay_team_payment_subscription_key
  * azurerm_key_vault_secret.liberata_supplier_subscription_key
  * module.cft_api_mgmt_product.azurerm_api_management_product_group.access_control_groups[&#34;developers&#34;]


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_api_management_subscription.fee_pay_team_payment_subscription will be created
  + resource "azurerm_api_management_subscription" "fee_pay_team_payment_subscription" {
      + allow_tracing       = true
      + api_management_name = "cft-api-mgmt-stg"
      + display_name        = "Payment API - Fee and Pay DTS Team Subscription"
      + id                  = (known after apply)
      + primary_key         = (sensitive value)
      + product_id          = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.ApiManagement/service/cft-api-mgmt-stg/products/payments"
      + resource_group_name = "cft-aat-network-rg"
      + secondary_key       = (sensitive value)
      + state               = "active"
      + subscription_id     = (known after apply)
    }

  # azurerm_api_management_subscription.liberata_supplier_subscription will be created
  + resource "azurerm_api_management_subscription" "liberata_supplier_subscription" {
      + allow_tracing       = true
      + api_management_name = "cft-api-mgmt-stg"
      + display_name        = "Payment API - Liberata Subscription"
      + id                  = (known after apply)
      + primary_key         = (sensitive value)
      + product_id          = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.ApiManagement/service/cft-api-mgmt-stg/products/payments"
      + resource_group_name = "cft-aat-network-rg"
      + secondary_key       = (sensitive value)
      + state               = "active"
      + subscription_id     = (known after apply)
    }

  # azurerm_key_vault_secret.fee_pay_team_payment_subscription_key will be created
  + resource "azurerm_key_vault_secret" "fee_pay_team_payment_subscription_key" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ccpay-aat/providers/Microsoft.KeyVault/vaults/ccpay-aat"
      + name                    = "fee-pay-team-payment-cft-apim-subscription-key"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.liberata_supplier_subscription_key will be created
  + resource "azurerm_key_vault_secret" "liberata_supplier_subscription_key" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ccpay-aat/providers/Microsoft.KeyVault/vaults/ccpay-aat"
      + name                    = "liberata-cft-apim-subscription-key"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.cft_api_mgmt_product.azurerm_api_management_product_group.access_control_groups["developers"] will be created
  + resource "azurerm_api_management_product_group" "access_control_groups" {
      + api_management_name = "cft-api-mgmt-stg"
      + group_name          = "developers"
      + id                  = (known after apply)
      + product_id          = "payments"
      + resource_group_name = "cft-aat-network-rg"
    }

Plan: 5 to add, 0 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":128,"Program":"tfcmt","SHA1":"","Target":"aat","Vars":{}} -->